#1 основное это репозиторий что содержит код -- 
#2 комиты (фиксируют изменения), что позваляет откатиться назад или вперед он созраняет (точка сохранения)
#3 ветки в пораллельной разработки
#слияние объеденяет изменения для этого используют (git pull origin dev)

"""new reposotory, name, public/private, crate repository"""
# git init   - создает git репозиторий из текущей папки
# git add .   - добавляет файлы и папки для отслеживания в index (эту команду пишем каждый раз перед командой commit)
# git commit -m 'сообщение'   - создает новую версию, если были изменения в отслеживающихся файлах

# git log   - показывает все коммиты
# git status   - показывает состояние файлов

# git checkout ветка_или_id_коммита   - переход на другую ветку или коммит



